Merge pull request #7 from LeGiaVan/dev
Dev
